Ran Plan for project: `dynamodb` dir: `conf/dynamodb` workspace: `default`

<details><summary>Show Output</summary>

```diff
rm -rf .module .terraform
mkdir -p .module
terraform init
Copying configuration from "git::https://github.com/cloudposse/terraform-root-modules.git//aws/dynamodb?ref=tags/0.115.0"...
Downloading git::https://github.com/cloudposse/terraform-aws-dynamodb.git?ref=tags/0.15.0 for dynamodb...
Downloading git::https://github.com/cloudposse/terraform-aws-dynamodb-autoscaler.git?ref=tags/0.5.0 for dynamodb.dynamodb_autoscaler...
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.16.0 for dynamodb.dynamodb_autoscaler.default_label...
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.16.0 for dynamodb.dynamodb_label...
Downloading git::https://github.com/cloudposse/terraform-aws-backup.git?ref=tags/0.1.1 for dynamodb_backup...
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.15.0 for dynamodb_backup.label...
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.15.0 for dynamodb_backup.label_backup_role...
- dynamodb
- dynamodb.dynamodb_autoscaler
- dynamodb.dynamodb_autoscaler.default_label
- dynamodb.dynamodb_label
- dynamodb_backup
- dynamodb_backup.label
- dynamodb_backup.label_backup_role

Initializing modules...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "null" (hashicorp/null) 2.1.2...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.44.0...
- Downloading plugin for provider "local" (hashicorp/local) 1.4.0...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Failed to parse plan. Returning original input.
[ -f .terraform/terraform.tfstate ] || terraform init
terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.dynamodb_backup.data.aws_iam_policy_document.assume_role[0]: Refreshing state...
module.dynamodb.module.dynamodb_autoscaler.data.aws_iam_policy_document.assume_role: Refreshing state...
module.dynamodb.module.dynamodb_autoscaler.data.aws_iam_policy_document.autoscaler_cloudwatch: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.dynamodb.aws_dynamodb_table.default[0] will be created
  + resource "aws_dynamodb_table" "default" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "trader_id"
      + id               = (known after apply)
      + name             = "cpco-testing-trader-page-stats"
      + range_key        = "ds"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name"      = "cpco-testing-trader-page-stats"
          + "Namespace" = "cpco"
          + "Stage"     = "testing"
        }
      + write_capacity   = 5

      + attribute {
          + name = "ds"
          + type = "S"
        }
      + attribute {
          + name = "trader_id"
          + type = "N"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled = true
        }

      + ttl {
          + enabled = false
        }
    }

  # module.dynamodb_backup.aws_backup_plan.default[0] will be created
  + resource "aws_backup_plan" "default" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "cpco-testing-trader-page-stats"
      + version = (known after apply)

      + rule {
          + completion_window   = 120
          + recovery_point_tags = {
              + "Name"      = "cpco-testing-trader-page-stats"
              + "Namespace" = "cpco"
              + "Stage"     = "testing"
            }
          + rule_name           = "cpco-testing-trader-page-stats"
          + schedule            = "cron(0 12 * * ? *)"
          + start_window        = 60
          + target_vault_name   = "cpco-testing-trader-page-stats"

          + lifecycle {
              + cold_storage_after = 180
              + delete_after       = 360
            }
        }
    }

  # module.dynamodb_backup.aws_backup_selection.default[0] will be created
  + resource "aws_backup_selection" "default" {
      + iam_role_arn = (known after apply)
      + id           = (known after apply)
      + name         = "cpco-testing-trader-page-stats"
      + plan_id      = (known after apply)
      + resources    = (known after apply)
    }

  # module.dynamodb_backup.aws_backup_vault.default[0] will be created
  + resource "aws_backup_vault" "default" {
      + arn             = (known after apply)
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "cpco-testing-trader-page-stats"
      + recovery_points = (known after apply)
      + tags            = {
          + "Name"      = "cpco-testing-trader-page-stats"
          + "Namespace" = "cpco"
          + "Stage"     = "testing"
        }
    }

  # module.dynamodb_backup.aws_iam_role.default[0] will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cpco-testing-trader-page-stats-backup"
      + path                  = "/"
      + tags                  = {
          + "Attributes" = "backup"
          + "Name"       = "cpco-testing-trader-page-stats-backup"
          + "Namespace"  = "cpco"
          + "Stage"      = "testing"
        }
      + unique_id             = (known after apply)
    }

  # module.dynamodb_backup.aws_iam_role_policy_attachment.default[0] will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      + role       = "cpco-testing-trader-page-stats-backup"
    }

  # module.dynamodb.module.dynamodb_autoscaler.data.aws_iam_policy_document.autoscaler will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "autoscaler"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:UpdateTable",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /conf/atlantis/.atlantis/repos/cloudposse/testing.cloudposse.co/85/default/conf/dynamodb/dynamodb-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/conf/atlantis/.atlantis/repos/cloudposse/testing.cloudposse.co/85/default/conf/dynamodb/dynamodb-default.tfplan"


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p dynamodb`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.us-west-2-ecs.testing.cloudposse.co/lock?id=cloudposse%252Ftesting.cloudposse.co%252Fconf%252Fdynamodb%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p dynamodb`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
